'''
============================================
[입력]
3
5 2 5
1 2 3 4 5
2 7
4 8
5 5 4
13787 32221 32402 32498 4169
3 5902
3 9752
3 27737
1 14133
0 16547
10 10 8
16243 26767 22174 25277 17456 13398 29850 22297 1382 31246
9 23198
7 17514
11 24247
0 25306
2 9104
6 28112
12 7491
10 26972
17 22639
12 28722

[출력]
#1 4
#2 32402
#3 13398
============================================
'''


test_case = int(input())
for t in range(test_case):
  N,M,L = map(int, input().split())
  data_list = list(map(int, input().split()))
  for i in range(M):
    idx,val = map(int, input().split())
    data_list.insert(idx,val)
  print("#{0} {1}".format(t+1,data_list[L]))